{"topics": {"0": "FOREWORD", "1": "ABOUT IIITD", "2": "ABOUT IIITD;CAMPUS AND INFRASTRUCTURE", "3": "ABOUT IIITD;Some Key Features", "4": "ABOUT IIITD;Energy", "5": "ABOUT IIITD;Some Key Features;Waste Water Recycling", "6": "ABOUT IIITD;Some Key Features;Rainwater and Landscape", "7": "ABOUT IIITD;Some Key Features;How to Reach the Campus", "8": "ABOUT IIITD;Some Key Features;Internet", "9": "ABOUT IIITD;Some Key Features;Library and Information Centre", "10": "ABOUT IIITD;Some Key Features;Neighbourhood", "11": "ABOUT IIITD;Some Key Features;LIFE @ IIITD", "12": "ABOUT IIITD;Some Key Features;Clubs", "13": "ABOUT IIITD;Some Key Features;Sports and Recreation", "14": "ABOUT IIITD;Some Key Features;Gym", "15": "Fests and Events", "16": "Fests and Events;Community Work and Self Growth", "17": "Well-Being Cell", "18": "Well-Being Cell;Goal :", "19": "HOSTEL, MESS AND CAFETERIA", "20": "HOSTEL, MESS AND CAFETERIA;Hostel Allotment", "21": "OTHER FACILITIES", "22": "OTHER FACILITIES;Medical Facilities", "23": "OTHER FACILITIES;Banarsidas Chandiwala Institute of Medical Sciences", "24": "OTHER FACILITIES;Triton Hospital, Nehru Enclave", "25": "OTHER FACILITIES;Irene Hospital located at DD-23, Kalkaji", "26": "ATM Banking Facility", "27": "ACADEMICS", "28": "ACADEMICS;Attendance Policy", "29": "ACADEMICS;Academic Rules", "30": "ACADEMICS;Ordinances for B.Tech. Program", "31": "ACADEMICS;Academic Rules;Academic Evaluation", "32": "Medical Absence", "33": "Medical Absence;Approval and Make up Exam Rules:", "34": "Medical Absence;Duplicate ID", "35": "FEE PAYMENT AND FEE WAIVER", "36": "FEE PAYMENT AND FEE WAIVER;Fee Payment", "37": "FEE PAYMENT AND FEE WAIVER;FEE PAYMENT AND FEE WAIVER;RELEVANT POLICIES", "38": "FEE PAYMENT AND FEE WAIVER;FEE PAYMENT AND FEE WAIVER;Vehicle Policy", "39": "FEE PAYMENT AND FEE WAIVER;FEE PAYMENT AND FEE WAIVER;Parking Policy", "40": "FEE PAYMENT AND FEE WAIVER;FEE PAYMENT AND FEE WAIVER;Disciplinary Action", "41": "IT Policy", "42": "IT Policy;Student Council", "43": "IT Policy;Objectives of the Student Council:", "44": "IT Policy;Student Senate", "45": "IT Policy;Objectives of the Student Senate:", "46": "IT Policy;Student Employment", "47": "ANTI-SEXUAL HARASSMENT", "48": "ANTI-SEXUAL HARASSMENT;Role of the ASHC/ICC :", "49": "GRIEVANCE REDRESSAL", "50": "GRIEVANCE REDRESSAL;How to open a Bank Account?", "51": "Whom to contact for Hostel-related problems?", "52": "Whom to contact for Hostel-related problems?;Whom to contact for lost/found property?", "53": "ADVICE FROM SENIORS", "54": "ADVICE FROM SENIORS;Engineering Career", "55": "ADVICE FROM SENIORS;Research Career", "56": "ADVICE FROM SENIORS;A high CGPA is highly desirable.", "57": "ADVICE FROM SENIORS;Entrepreneurship Career", "58": "ADVICE FROM SENIORS;A high CGPA is highly desirable.;Management Career", "59": "ADVICE FROM SENIORS;A high CGPA is highly desirable.;Get Into Management", "60": "ADVICE FROM SENIORS;A high CGPA is highly desirable.;Management Career;Get Into Some Non-Tech. Job", "61": "ADVICE FROM SENIORS;A high CGPA is highly desirable.;Management Career;Effective Study Habits", "62": "ADVICE FROM SENIORS;A high CGPA is highly desirable.;Management Career;Lectures", "63": "ADVICE FROM SENIORS;A high CGPA is highly desirable.;Management Career;Assignments", "64": "Weekly Revision/ Sync-Up", "65": "Weekly Revision/ Sync-Up;Prioritising Work", "66": "Weekly Revision/ Sync-Up;Help other students", "67": "Weekly Revision/ Sync-Up;Academics gets the first priority", "68": "Weekly Revision/ Sync-Up;Time Management", "69": "- IT Policy", "70": "- IT Policy;1."}, "paras": {"0": "This handbook has been put together to provide information which will be useful during your stay here — you may consider it as a user manual for IIIT Delhi. It also provides guidelines for expected conduct and behaviour of students within campus, both academic and non- academic. But it is not a rule-book — you will still need to refer to official documents available on our website and other places. Please read the disclaimer on the last page.", "1": "The information governing academics is available in other places. UG/ PG regulations should be used for rules governing your programs. This book is more about student life on the campus — extracurricular activities, sports, hostels etc. Please make use of the facilities and opportunities to develop your personality and bond with other students.", "2": "Life here is a lot different from school — you have more freedom and will be treated as an adult. We expect you to exercise this freedom with a sense of responsibility. Code of conduct given at the end, developed by Student Council, embodies the expected behaviour of students — respect for others and their privacy, academic honesty, caring for Institute property and equipment.", "3": "Indraprastha Institute of Information Technology Delhi (IIITDelhi) was created as a State University by an Act of the Delhi Government (The IIIT Delhi Act, 2007) empowering it to do research and development and grant degrees. IIIT Delhi was officially established on 10th June, 2008. The first class for B.Tech. (CSE) students was held on 8th September, 2008. The institute began with 60 B.Tech. students in 2008. Since then, it has come a long way, with over 65 faculty members specializing in diverse areas of Computer Science, Electronics and Communications, Applied Mathematics, Design Engineering, Social Sciences, Biosciences and Artificial Intelligence. In a relatively short time, it has earned a good reputation in India and abroad for being a centre of quality education and research.", "4": "The campus is spread over 25 acres of lush green land in South Delhi in Okhla Phase-lll, near Nehru Place. It is divided into 3 zones- Academic, Students’ Area and Faculty Residences. All these are close to each other so one can just walk across from one area to another. The academic area is primarily for work and is a “no noise” zone; therefore, the Students’ Area is to be used for any activity that may otherwise disturb others working in the academic area.", "5": "Phase II of the campus is now complete. This phase is about 70000 sq. meters including a new lecture hall complex, academic building, hostels, sports complex, etc.", "6": "The total capacity of the Institute is about 2500 students and 125 faculty.", "7": "The buildings of the campus are designed to be energy-efficient with insulation. A Building Management System (BMS) has been installed to optimise the use of air conditioning. The use of energy saving lighting systems and nonconventional energy through solar hot water systems and Solar photo-voltaic system has been installed to reduce power consumption and augment the grid supplied electric energy.", "8": "The entire wastewater generated in the campus is recycled using 2 sewage treatment plants with a capacity of 65 KL per day, and water so generated is used for horticulture, flushing and air-conditioning works. A garbage segregation scheme for productive and safe disposal of solid waste has been worked out with a local NGO.", "9": "Fire-Fighting Equipment The entire area is equipped with fire alarms and fire-fighting equipment such as wet risers/sprinklers and smoke management systems.", "10": "Eighty percent of the campus grounds are soft landscape (including some parking and circulation area). Many of the vehicular areas allow percolation. Rainwater harvesting pits and collection tanks have also been provided. The location of buildings on the higher ground affords distinct views towards the Bahai Temple to the north-west and over the forest reserve to the south.", "11": "Students can walk down from Govindpuri Metro Station as our campus is just a little over 500 meters away from there. Besides, a walk-way connecting our campus to the Okhla Metro Station is operational now.", "12": "IIIT-D has truly world-class, campus-wide state of the art information technology tools that are designed to meet the computing and communication needs of the institute, which has a fast, reliable and rugged computer network of more than 4000 Nodes. The institute has more than 200 laptops issued to its faculty, staff and students. To provide printing and other facilities, the institute has more than 150 printers and scanners. In order to facilitate proper teaching aid, all classrooms are equipped with projectors and audio systems. All the hostels, faculty blocks, administrative block, library, classrooms, and residences, are connected through a redundant 10 gigabit fibre backbone network. All the blocks are connected through layer 2 & 3 switches to provide 1Gbps connectivity at the user end. Every hostel room has a dedicated LAN connection to provide round the clock access to resources on the net. Wireless network with 200+ access points is also enabled in the faculty block, library, classrooms and hostel blocks.", "13": "The Library and Information Centre of the Institute is housed in a separate building on its Campus. It is a user-focused centre of learning resources that meet all the requirements of IIIT-Delhi academic and research fraternity regarding learning, teaching, research, and training programs. The Library is fully automated using RFID Technology with EM Security System. The Library is enriched with a vast collection of print and electronic resources in all areas of interest. It provides 24x7 different types of learning spaces to its users (Individual study carrels, quiet study, group study, casual study, group discussion).", "14": "In addition, the Library takes initiatives to make it more useful for its users like organizing workshops on Writing, Publishing, Reading, Referencing, Plagiarism, Higher education opportunities abroad. The Library organizes the annual book exhibition and course book display in every semester for developing the collection in Library and fulfilling the course book requirements of students.", "15": "More details about IllT-Delhi Library can be accessed at http://library.iiitd.edu.in.", "16": "For latest updates, please check the Library Facebook page at https://www.facebook.com/IIITDelhiLibrary", "17": "For any inputs and suggestions, please contact at library@iiitd.ac.in, 011-26907510, 503, and 513", "18": "ll1T-Delhi is situated in the industrial hub of Okhla, where various shopping options are also available. Nehru Place, GK I/II and departmental store like Savemax at the Kalkaji metro station provide for daily needs and clothing at a competitive price. Besides, the campus is just a few hundred meters away from Govindpuri Metro Station, a big advantage for students using the metro service.", "19": "Although the institute aims to develop students academically, they also enjoy various extracurricular facilities.", "20": "Participation in activities of approved student groups (club, chapter, student senate/council, etc.) is strongly encouraged in the first two years - students who are active in any of the activities will be given certificate through the relevant club / group.", "21": "At IIIT-Delhi, a major chunk of students’ time goes in academics as it requires hard work and focused effort. Nonetheless, there are many facilities and 22+clubs to grow in various ways. Students take part in a number of social and cultural activities. If they want to pursue a hobby, they just need to find some likeminded people to start their own club (if not already in existence) in the Institute. These clubs not only improve leadership skills but also help in building team spirit. Several student clubs in the institute enable students to enhance their talent in areas beyond academics. The clubs at IIIT- Delhi are based on adventure, music, software development, community work, dramatics, entrepreneurship, electronics, programming, game development, dance, painting, design, photography, chess, quizzing, sightseeing, public speaking, eco-development and more. These clubs enable students to share knowledge and mentor those looking to break into the field. These clubs not only hone their leadership skills but also help instil team spirit in them. Last year; student bodies organized as many as 105 events. Several student clubs in the institute enable them to enhance their talent in areas beyond academics. Clubs already in existence at IIIT Delhi are Quiz Club - Trivialis, Machaan, Astronauts, Design Club - Ink, Dance Club - MadToes, Byld, Women in Tech(WiT), Music Club Audio Bytes, Photography Club - Tasveer, the Literary Club, Eco Club and Computer Security club, FooBar, E-cell, Muse, Math club and many more. These clubs enable students to come together, share knowledge and mentor those looking to enter into the field. Students can also suggest books for the library, organize a blood donation campaign, an adventure trip during summer holidays or purchase a new instrument for the music room. In 2018-19 over 400 students participated in sports activities, 200 in cultural activities, 50 in quiz contests, and 400 in technical events. Students are also encouraged to help the society in some way or the other. Almost every student is involved with various NGOs all over the country. The institute also has its own home-grown NGO of students called 'FindAWay’, which helps the children in need.", "22": "Sports enthusiasts have plenty of options to engage themselves at IIIT Delhi. Here, we are building sports culture and participation among students from intra-college events like football, table tennis, Badminton, Pool tournaments and the Intramural, to external participation in the sports events of IIT Kanpur, IITBHU, IIT Roorkee, IIT Delhi, SNU,DTU, Delhi Half Marathon and Twaran, the inter-IIIT sports meet. Triquetra, a collaborative sports meet, is a joint initiative by officials and students of IIIT-Delhi, NSUT and DTU. It is an effort by these three leading technical Universities/institutes of the NCT of Delhi to jointly organize high quality sporting events in Delhi to provide a platform for college students to showcase their sporting talent.", "23": "The institute is equipped with a number of indoor and outdoor sports facilities. Institute new sports complex is equipped with badminton court, Table Tennis tables, Pool tables Squash courts, Swimming pool, while Chess boards and Carrom boards are available in the hostel common rooms. The institute also has a multi-purpose sports field, two tennis courts, a basketball court, a volleyball field with lighting facilities at the courts. Institute has also provided coach facility for students; institute self-growth activities include active participation from the students under various sports activities.", "24": "Institute sports council and coordinators can be approached at https: //iiitd.ac.in/life/student-clubs. Facebook page: https://www.facebook.comiiiitds portscouncil", "25": "The institute’s gym offers facilities like treadmills, cross-trainer, recumbent bike, abdominal machine and dumbbells. Gym trainers are also available during morning and evening sessions.", "26": "There are two main student festivals - the technical festival Esya organized in August, which has now become one of the most vibrant tech-fests in Delhi, and the cultural festival Odyssey organized in January. Both these festivals have large external participation and have various contests. Students are also organizing the TEDxIIITD event since last five years, which was hugely successful with excellent young inspirational speakers. It has now become a regular event. Research Showcase and other Tech events also demonstrate the student capabilities. The cultural fest Odyssey saw a footfall of 8000 visitors in 2019. Activities (arts and literary) for the year are planned together by the Student Council and the Cultural Secretary. In all, a good number of extracurricular activities take place on the campus throughout the year. 'ESYA' which means a journey, an adventure - exploring Infinity and beyond, is the IIIT-Delhi's TechFest, and is one of the largest events organized annually on the campus. Esya is a platform to not only showcase technical expertise but also integrate technology with social causes. After five successful years that saw promising talents and immense reception, Esya'18 saw an even larger participation. The two day festival included a series of unique and challenging events such as Data Hackathon, Hardware Hackathon, HuntlIT, RoboWars, Chess, and Circuitrix.", "27": "Students are encouraged to help the society in some way or the other. Almost every student is involved with NGOs all over the country. Students are also encouraged to learn activities like Bird Watching, Basketball, Table Tennis, Swimming, Cooking, Painting, Yoga, Aerobics, and Foreign Language for their personal growth and development. It is also mandatory for every undergrad student to earn 2 credits of Community Work and 2 credits of Self Growth by working for 70-80 hours for each.", "28": "Well-Being Cell at IIIT Delhi offers free and confidential psychological support to all the students and staff members of the university. This is a kind of support system in which professionally trained and widely experienced Counselling Psychologists, who are accustomed to helping people from many different backgrounds and cultures with a wide range of issues, provides special assistance to individuals in dealing with behavioural concerns.", "29": "The main focus of the Well-Being Cell is to provide timely psychological support to all at IIIT Delhi so as to help them gain understanding and an insight into difficulties & challenges they may be experiencing, to develop emotional resilience, enabling them to fulfil their academic and personal potential.", "30": "To help a student cope with stress, professional counsellors Dr.Amita Puri and Khushpinder P. Sharma are available at the institute for sessions and meetings with students. Such sessions and meetings are strictly private and confidential.", "31": "If you’re sick or feeling isolated or depressed, please take advantage of the many services offered by our well-being cell. You don’t have to face these issues by yourself and feel hopeless or depressed. No, not at all. We are here only for you.", "32": "Please call at these numbers to get immediate help anytime.", "33": "Mr. Khushpinder P.Sharma Dr.Amita Puri +91-9815181252 +91-7838732232 khushpinder@iiitd.ac.in amitapuri@iiitd.ac.in", "34": "There are various modes of counselling consultations including face to face interactions, e-mailing, WhatsApp or just tele talks. There is really no need to suffer unnecessarily in case of any emotional issues you require help in dealing with. The campus counsellors are there for your support and welfare. Please meet us anytime or shoot a mail and interact with them at your pace and space.", "35": "To ensure that students remain in charge of their emotions at all times, here are some tips to settle and thrive in first year:", "36": "IIIT Delhi provides accommodation to students wishing to reside in the hostels. At present, there are three hostels, two for the boys having 372 & 394 beds and another for the girls with 164 seats. There are 22 married hostel accommodations available for married Ph.D. students. Each room in both the hostels is provided with furniture needed by a student - bed, table, chair, bookshelf, cupboard, etc. The rooms are provided night time air conditioning in summers, and heating in winters. High-speed Internet connectivity is also available in hostels. At present, the hostels have options of single and double occupancy rooms, all of which are air-conditioned. There are 4 guest rooms available at the hostels for guests visiting the institute. All hostel students are completely free to move around the campus at all times, and some of the study areas are open 24x7 for the benefit of students. In order to provide 24X7 medical cover for our Faculty, Staff and students both staying in hostel and day scholars the Institute has set up an Infirmary at Ground Floor in the girl's hostel. There is a common mess for the boys and girls which function during the working semester. Air conditioning is provided in the mess during lunch time. During the winter and summer vacations, a special mess runs for students who are required to stay in the hostels for pursuing academic, sports or cultural activities.", "37": "An external security agency has been contracted for providing security at the hostels. The services of the security personnel are monitored by the GM-Facility Management Services (FMS). Besides, a Mess Committee is formed out of representatives from hostel committees and day scholars. The Mess Committee monitors the quality, taste and hygiene of the food served in the mess. They also interface with the mess vendor to provide him with the feedback of students and effect changes in the weekly menu. Periodical review and inspection of the quality of food items also form part of their duties.", "38": "Based on the recommendation of the Hostel Allotment Committee, hostel is allotted to eligible students by the Hostel in-Charge. The points related to allotment are:", "39": "All PhDs and married PhDs who apply for hostel accommodation will get the hostel. All outside Delhi students of B.Tech. and M.Tech. programs, who apply for hostel accommodation will get the hostel. Restall will be allotted according to their distance from the institute.", "40": "Online applications are invited during vacations for existing students. Based on the specified criteria, the allotment committee recommends the allotment and the list is published on the website with instructions for necessary payments and possession. For new students, hard copy/     « Hostel residents are not allowed to leave the campus without permission after mid-night.", "41": "A non-resident cannot stay in the hostel overnight Cooking in the rooms is prohibited.", "42": "A student's parents and other same-gender guests may visit the student in his/her room from 8 am-8 pm. Any other visitor can only be met in common room of the hostel. Hostel related communications shall be done via adminhostel@ iiitd.ac.in. E-mails sent to any other email id will not be entertained.", "43": "Our campus is situated in the heart of Delhi and that is why we rely on facilities available in the city for most things. However, some necessities such as stationery and general supplies are available on the campus.", "44": "In order to provide 24X7 medical cover for our Faculty, Staff and students both staying in hostel and day scholars the Institute has set up an Infirmary at Ground Floor in the girl's hostel.", "45": "Qualified Medical Practitioner (B.Sc, MBBS, FCPG) is available in our premises six days a week from Monday to Saturday between 13:00-15:00 Hrs. Qualified Male Nurse, Mr. Ajay is available from Monday to Saturday from 9.00 PM to 7.00 AM and Ms. Aiswarya is available from Monday to Saturday from 8.30 AM to 5.30 PM at the infirmary. Both can be reached at Ext: 531  3. Qualified Gynaecologist { M.B.B.S(RIMS), M.S.(LHMC),  DNB,FMAS,DMAS} is available in our premises two days a week on Monday and Friday between 15:00 to 16:00 Hrs.", "46": "It is located next to our campus, provides OPD facilities between 9 a.m-1 p.m every day except on Sundays and holidays. The students are offered a special rebate of 10% on the total bill, excluding the cost of medicines. The students are expected to show their identity card at the time of billing. The hospital offers treatment in all areas of healthcare except those needing Intensive Care facilities. It does not have an operational casualty round the clock however, as a special case the hospital has extended the services of Resident Medical Officer available 24/7. Any student requiring Intensive care can be transferred to Apollo Hospital Ambulance. For help, call 49020269 and 49020200.", "47": "Triton Hospital stands in the heart of the National Capital, located in Nehru Enclave, Kalkaji. Ever since its inception, the hospital has been offering the top notch treatment at affordable prices in the hour of need.", "48": "The hospital is a well-equipped building that houses team of hardworking, dedicated and highly qualified specialists doctors. The hospital is born from the heart of the cohesive group of eminent doctors under the leadership of Dr. Anuj Gupta, with a collective post MD experience of over 11 years in the field of Paediatrics and Neonatal intensive care.", "49": "It is a 40-bed hospital with 24 hrs ICU and Emergency backup. It provides Free 24 hr Ambulance Services in case of emergency. The subsidized charges for l1T-Delhi student in OPD are Rs 150/-per consultation. Also, a discount of 10% is available on any services of the hospital. The hospital’s phone number is 49922222.", "50": "Indraprastha Apollo Hospital, Sarita Vihar, Mathura Road", "51": "It is at the forefront of medical technology and expertise. It provides a complete range of latest diagnostic, medical and surgical facilities for the care of its patients. The hospital offers a 10% Discount on Standard Apollo Health Check Packages for students and 5% discount on in-patient services on Room Rent & Investigations (Except Critical Care Beds). The hospital extends personal assistance in admissions and treatment. Apollo hospital's call centre number: 26925858/01 & Extn.1090/91  Photocopying and Scanning Facilities  A shop for basic supplies has been opened on the ground floor of the Dining block, which also offers photocopying/scanning facilities on payment basis. The students may also visit nearby markets in Govindpuri, Kalkaji and Nehru Place for purchasing consumer goods and other necessities.", "52": "HDFC ATM is located on the ground floor of dining block and Andhra Bank ATM on the Ground Floor of Academic Building. Besides, a cheque drop box has been kept outside the Accounts Section in the Academic Building where the cheques meant to be deposited in HDFC bank can be dropped by the account holders of HDFC. For education loan, fee receipts and opening of bank account, the students may contact the Accounts Section, which is housed on the first floor of Academic Block.", "53": "At the beginning of the first year, a student participates in the one week Induction cum orientation program. The main goal of the Induction Program is to help students have an easy transition from School to College life. Specifically, we hope that at the end of the program students are committed and excited about learning. Classes generally start around 9 am, but may commence earlier sometimes. Some classes can also be arranged on Saturdays. Students are also provided with a soft copy of the Student Handbook apart from an identity card. Students are given Smart Cards to enable them to access labs in the academic area. B.Tech. labs on the third floor of the New Lecture Hall Complex are accessible to all under- graduate students, who may also get access for M.Tech. labs at the discretion of the faculty. E-mail Ids within the institute’s domain are created for new students by the IT department. All communication with the students is primarily done through Email, hence it’s the responsibility of the students to carefully read all the Emails. Every student will also be provided with ERP account where he/she has to register his/her mandatory/elective courses every semester and can check his/ her grades. It’s the responsibility of the student to do timely registration of courses.", "54": "Attendance is taken in all core courses. Students having less than 75% attendance in core courses are issued warning and other actions as approved by the Senate may be taken.", "55": "Regulations for B.Tech. Program Specific Regulations for B.Tech. (CSE)Program Specific Regulations for B.Tech. (ECE) Program Specific Regulations for B.Tech. (CSAM) Program . Specific Regulations for B.Tech. (CSD) Program", "56": "Specific Regulations for B.Tech. (CSSS) Program Specific Regulations for B.Tech. (CSB) Program Specific Regulations for B.Tech. (CSAI) Program Regulations for Minor in Economics Regulations for Minor in Computational Biology (CB) Specific Regulations for Dual Degree. (CSE and ECE) Program Ordinances for PG (M.Tech. and PhD) Program Regulations for PG (M.Tech. and PhD) Program Specific Regulations for M.Tech. (CSE) Program Specific Regulations for M.Tech. (ECE) Program Specific Regulations for M.Tech. (CB) Program", "57": "All the above documents are available athttps://www..iiitd.ac.in/academics/ resources", "58": "Each course is conducted by the assigned Instructor with the assistance of teaching fellows and/or teaching assistants. The Instructor is responsible for conducting lectures, tutorials, and labs, holding the tests and examinations, evaluating the performance of the students, and awarding grades at the end of the semester/ summer term. A system of continuous evaluation is employed, in which, during the course, various instruments like tests, assignments, projects, mid-semester and end—semester exams etc. are given to assess the learning of students. All evaluations are the responsibility of the instructor of the course. At the end of the semester, based on the overall performance in the course, a letter grade is awarded to each student by the instructor. Each letter grade carries certain points which are used in the computation of the semester/overall performance.", "59": "If a student is absent on medical grounds, he/she must submit a medical certificate to the Academic section. All leave is approved by DOAA. Maximum duration of leave is defined in UG/PG regulations. Leaves over and above the allowed time period results in Semester Leave.", "60": "Rules for absence from exams on medical ground:", "61": "In case of absence from Exam, students should inform the Instructor through email with cc to admin-btech@iiitd.ac.in before or on the day of exam. No late information will be considered. Medical certificate needs to be submitted to Academic Section through Email or on the very first day of joining back to the Institute. Medical leave for missing the mid-sem/end-sem exams can be considered only twice during the tenure of the program.", "62": "Medical certificate may be verified from the concerned Doctor. The certificate will be sent to the Institute Doctor and further to DOAA for approval. Only approved cases will be informed to the instructor and the concerned student. Instructor may conduct a re-exam or may grade the student on the basis of his/her performance during the semester (This will vary from course to course). However if End Sem Exam has been missed, re-exam will be mandatorily conducted. In case of re-exam, level of re-exam will normally be harder than the regular exam.", "63": "If a student loses his/her identity card, duplicate identity card may be issued on submitting an application to the Academic section, lodging of      Plagiarism  IIIT Delhi maintains global academic standards and does not tolerate any form of academic dishonesty. Almost all violations of academic honesty in course submissions (homework assignments, project reports) are instances of plagiarism. An example of Academic dishonesty is when some part(s) of a student's assignment are someone else’s writing/idea/art (for example a friend, a solution manual, a website), but the student claims it as his/her own by not explicitly making it clear that these parts are someone else's.", "64": "If, for whatever reason, a student has to use some existing work, the student cannot copy and can only borrow. Therefore, it is the student's responsibility to explicitly indicate which parts are borrowed. A student is allowed to borrow definitions, formulae, figures, one sentence, etc.by:", "65": "Attributing it to the original source and 2. Making it absolutely clear that the copied part is not the student's own(a student needs to do both)  For more information, please visit https://www.iiitd.ac.in/jacademics/ resources/academic-dishonesty  Academic Contact Points  « For course-related issues: Instructors, TFs and TAs  « For program related matters/guidance: Program Coordinator  « For policy matters and during special situations: Manager(Academics),UGC/PGC Chairs, DOAA  + Other routine Academic issues (like course registration, issuing of certificates, transcripts etc.) :", "66": "Ms Anshu Dureja/Ms Nisha Narwal/Ms Prachi Mukherjee — For B.Tech. students", "67": "Mr Ashutosh Brahma = — For M.Tech. students", "68": "Ms Priti Patel — For Ph.D. students", "69": "Academic and Hostel Fee can be paid ", "70": "Students are expected to abide by the rules of conduct and maintain peace and discipline in the campus. They should follow the policies formulated by the institute from time to time for mutual benefit of the two sides. Most of the policies are given in this section.", "71": "All vehicles entering the Campus shall do so from Gate No 1. Resident students are not allowed to use their personal vehicles inside the campus. The vehicles entering the campus shall keep themselves to the left of the road. The campus is a No Horn Zone and a maximum speed of 20 km/hr is permissible. All dayscholars using their vehicles will have to display the car sticker prominently, while visitors’ vehicles shall do the necessary registration at the main gate at entry.", "72": "Hostel residents are not allowed to keep a motorized vehicle inside the campus and any violation of this may attract a fine of Rs.200/- for the first time. In a bid to discourage the use of private transport by day-scholars also, a nominal parking charge will be levied on those bringing their vehicles to the campus. The complete vehicle and parking policy is appended to the end of this document (Appendix-!)  Anti-Ragging Policy  IIIT Delhi has zero-tolerance policy on ragging, which is a punishable offence. The institute has formed an anti-ragging committee and squads. Besides, each student of the institute and his/her parents and/or guardians are required to submit a combined undertaking against ragging at the time of registration, which is amandatory process. All concerned officials of the institute, students, parents and guardians of the students, members of the anti-ragging committee and squad need to adhere to the stipulations on the matter and effectively monitor and comply with the provisions made against ragging. The institute has following measures in place:", "73": "Institute level Anti-ragging Committee Hostel-Level Anti-ragging Committee: Message/Complaint Boxes near to the academic area. Undertaking from the Students and Parents. Disciplinary Action In case of violation of the above rules following disciplinary action is proposed: Removal from hostel Referring the case to disciplinary action committee", "74": "Indiscipline, which can lead to disciplinary action against a student, will include, but not be confined to, physical abuse of any person or any action that threatens or endangers the emotional well-being, health, or safety of any person; theft of or damage to property of the Institute; unauthorized entry to or use of the facilities of the Institute; obstruction or disruption of teaching, research, administration, hearing procedures, or other activities of the Institute; forgery, alteration, or misuse of documents or records of the Institute or, knowingly furnishing false information to the Institute; and violation of code of conduct & regulations of the Institute. Besides, failure or refusal to appear upon request or to cooperate in the investigation or hearing of cases of alleged offenses; incidents of academic dishonesty such as copying in home assignments, term papers, reports etc. (or providing solution for copying), copying programs/ code, collaboration and taking help when disallowed, cheating or providing help in exams, proxy attendance, changing answer sheets after submission, etc.may also lead to disciplinary action against a student. All cases of indiscipline shall be referred to the Disciplinary Committee, comprising at least three faculty members and two non-voting student representatives, except some cases of cheating where the course instructor can take suitable action. A student, however, can appeal against the decision of the instructor to the Disciplinary Committee.", "75": "Students with authorized accounts may use the computing, networking, and other IT facilities for academic purposes, official Institute business, and for personal purposes so long as such use does not violate any law or any Institute policy. Users are expected to respect the privacy of other users and they may not allow any other person to use their password or share their account.        STUDENT GOVERNANCE AND EMPLOYMENT  IIIT Delhi supports two active student bodies, namely Student Council and Student Senate. The Student Council gives the elected Student Representatives a chance to articulate their views and ideas in all studentrelated matters of the institute along with academic and extra-curricular activities within the context of the institute. The Student Senate focuses on improving the teaching and learning on campus and academic issues being faced by students and acts as a bridge between the student body and the Institute authority to discuss academic matters. The student charter containing the model code of conduct is appended to the end of this document.", "76": "The Student Council (SC) has two (or three) representatives from each branch for every UG and PG batch who are elected every year. PhD students are also invited to be part of the Student Council in the form of a committee. Elected representatives elect a secretary and a treasurer who are members of the council. The SC then proceeds to appoint a cultural coordinator, a sports coordinator, an alumni coordinator, an overall club coordinator and a technical coordinator. These coordinators are responsible for running various extracurricular activities in the campus and outside participation.", "77": "The SC meets regularly to discuss various student activities and issues. Along with designing the non-academic calendar of the institute in consultation with the Dean of Student Affairs, the Student Council manages existing clubs through budgets and annual reports. It also decides which clubs to start, after reviewing the necessary applications.", "78": "To safeguard and promote academic interests of the students To advise the UGC and council - and to that extent influence academic policy To maintain and assist active engagement for students in academics", "79": "The Student Senate (SS) has one elected student representative from each branch for every UG and PG batch. Once elected, just like the Council, the representatives elect a Secretary and a Senate coordinator. The Senate coordinator is responsible for representation of the Student Senate in the Student Council, the UGC and the Institute's Senate. The Secretary is responsible for internal coordination within the Senate. The SS meets regularly to discuss various student activities and issues. It encourages any and all initiatives taken up by students towards creating a better and more involving academic atmosphere. It also manages the student self-help groups, by allocating mentors and looking after its smooth functioning.", "80": "Toimprove teaching and learning on campus. To provide advisory opinion to the institute in formulation of significant student related policies. To facilitate communication between students, faculty, and administration of the institute. Torepresent the interests and concerns of students to the institute. Toimprove the quality of student life at the institute.", "81": "A UG student can be engaged on a part-time basis for academic and IT-related work if he/she is a regular student of B.Tech., has CGPA of 8.0 or more and no disciplinary action is pending against him/her. If a student is selected for such a job, he/she will have to work a minimum four hours a week and not more than eight hours a week. The student will be eligible to receive monthly payment of Rs 6,000.", "82": "lIIT-D has constituted an Anti-Sexual Harassment Committee (ASHC) also known as Internal Complaint Committee (ICC), whose main objectives are to ensure a harassment-free environment for all those who are studying or working in the institute, and to address any harassment complaint. The committee consists of a few male and female faculty members from the Institute as well as a counsellor.", "83": "To provide conciliation to settle the matter between her and the respondent. Conduct inquiry within the time frame (90 days) as prescribed in the Act. Prepare inquiry and settlement reports & submit the same to the Director. Ensure confidentiality in conciliation proceedings and conducting inquiry as well as in keeping records.", "84": "Students may approach different people for different types of grievances. Below are various levels for addressing the issues. In case the issue remains unresolved at the first level or the issue is due to the person at the first level, students may go to the second level and further. If a student is still not satisfied, he/she may contact the Director.        SOME MORE USEFUL INFORMATION  How to reach IIIT Delhi from the airport (domestic and international)?  You may hire a taxi from the Airport. There is a pre-paid taxi counter inside the airport. The travel time from the airport is approximately 45-50 min.", "85": "How to reach IIIT Delhi from the New Delhi Railway Station?", "86": "You may hire a taxi from the railway station. The travel time from the railway station is approximately 40-45 minutes. You may use Metro service, which you will have to change at Central Secretariat and take the line going towards Badarpur and finally get down at Govindpuri Metro station or Okhla Metro station.", "87": "The HDFC representative comes to the institute’s Academic Building at the start of the session and facilitates opening of bank accounts. The Accounts Section will send an email to all fresh students and help in opening their bank accounts. The bank is located in Okhla Industrial Area, Phase-3.(Phone No. 42299618/41699422).", "88": "Where can | get information about courses being offered? You can get the basic information from https://iiitd.ac.in/academics/courses", "89": "Who do | meet for Academics related queries?", "90": "JM/AM Academics In Academic Section on the second floor of Academic Building.", "91": "Who do | meet for Identity Card queries? For any queries regarding | Card, you may approach Academic Section.", "92": "In case of any problem related to the hostel, you may meet caretaker of the hostel or JM/AM/DM (Students Affairs), GM (FMS) (second floor old Academic Building).", "93": "Whom to contact for NOC regarding internship? JM/AM (Training & Placements)", "94": "Whom to contact for E-mail and other IT-related services? Sr. Manager/AM in Server Room on the first floor of the Academic building.", "95": "FMS division on second floor, old academic building may be contacted in this connection.", "96": "Any other query, not specified above? Contact Academic Section.", "97": "ll1T-Delhi currently offers three different career which a student can pursue. The list of all options offered is given below:", "98": "Most sought after attributes for an engineering career are problem solving capabilities, learnability, understanding and effective use of technology and techniques, etc. For such a student, some suggestions are:", "99": "Ensure that your basics are strong, particularly in courses that are prerequisites for advanced courses(e.g. DSA, Algorithms, OS in CSE, S&S, Circuits, ELD, IE, F&W, DCS, Math, IP, DSA in ECE; Linear Algebra, P&S, Discrete Structures, Mathematics in CSAM; DDV, VDC, DPP in CSD). Ensure that you learn these well and do the assignments and projects in these courses. Those who want to be in analytics of any kinds should note that while PS does not form a pre - requisite to many courses, its understanding is very important for such jobs. Select electives that strengthen your ability for problem solving and make you learn new techniques and technologies and apply them. So, courses with programming assignments and/or projects are helpful including “conceptual” courses like advanced algorithms, optimization, etc.). In addition, ECE students should try to participate in labs/engineering design/ hardware design related projects to have a good hands-on experience. Instead of a minimum of two electives per semester, do three CSE/ECE/Mathematics/DES/SS electives(applicable to your respective branch) in your 3 and 4 years. Doan IP and BTP in engineering category. Do an internship in which you are required to build systems, develop applications, etc. This will strengthen your capabilities, as well as provide an opportunity to learn new things. An internship in a start-up can really be very helpful.", "100": "Participate in engineering type contests— programming, prototype development, etc., and follow blogs, search the internet ,etc. to go beyond the courses.", "101": "You do not have to necessarily have a high CGPA-your skills and capabilities matter a lot more.", "102": "Besides problem solving capabilities, this career will also require strong theoretical, conceptual, mathematical foundations, as well as a decent CGPA. Hence a good balance between them will be needed. Usually a postgraduate degree will be required if you want to pursue research.", "103": "Build solid foundations by deeply understanding the core courses—these will also build good engineering skills.", "104": "Build strong conceptual/theoretical foundations—take courses like DM,DSA, Math 1 and 2 seriously, and take some electives that are theory focused. For CSE-TOC, advanced algorithm courses, logic, advance theory courses, more Math courses like Number theory. For ECESS,CTD,IE etc. along with some electives like Digital VLSI Design, Wireless System Implementation, RF Circuit design, Analog CMOS design, DSP, VLSI Digital Design, Wireless Networks, Digital Hardware Design AELD, Computer Architecture.", "105": "For pursuing a career in design research it is strongly advised to be well versed with DPP and HCI courses. Students are also expected to keep in handy the concepts taught in DIS(Design of Interactive Systems) and  RISSD(Research in Social Sciences and Design). These are more advanced  core courses that build upon our knowledge of user research and analysis methods.", "106": "Do UR and BTP in Research Category. Take some courses on Internet which align with your interest.", "107": "Do your internship in a research group and try to publish (or at least submit) a paper in a good quality international conference/ journal.", "108": "In this career you may do your start-up, either immediately after finishing your degree, or after gaining some years of experience. Most likely your start-up will be technology enabled, or may be in technology itself. Hence, strong technology skills are necessary.", "109": "First two points of Engineering Career apply — you need to have strong problem solving skills and foundations for those.", "110": "Take the domain study course in summer and do it in some domain which interests you and where you can identify opportunities for proposing new solutions.", "111": "Consider doing some social entrepreneurship during your CW — develop some project with some friends and execute it, perhaps with some NGO.", "112": "Do a variety of courses as open electives in 3rd and 4th year to help you understand other areas where IT based solutions provide opportunities.", "113": "Do the ENT courses/stream in your 3rd year.", "114": "Do some IS/IP in which you solve some problem of some group of people; Do your BTP in Entrepreneurship Category.", "115": "Do internship in a start-up. In courses that have projects, find problems from real world/experience, so you understand the pain points of some group of stakeholders and try  to solve them in your project.", "116": "Take initiatives by contributing to student governance, institute initiatives, etc.", "117": "This is effectively the same as the “engineering career” route. After being an engineer for a few years, one can move into management through technical management route(which happens naturally), or doing an Executive MBA, or  Do MBA After B.Tech.", "118": "As you cannot be sure that you will get admission in some good MBA college, perhaps a sound strategy may be to plan for route(iii), and then see how things workout. By the way, general MBA market is in decline — only MBAs from good quality institutions land good opportunities.", "119": "First a clarification—most of the jobs will still tap on the technical strength of the student to provide consultancy/solutions, though the jobs may require more diverse skills also. Problem solving skills will still be highly valued. Assessment for such jobs will often be with respect to your program, and other general skills like teamwork, communication etc.— other skills needed for consultancy etc. are likely to be taught on the job.", "120": "Most students want to do well in their studies— they want to learn, get good grades/marks, and do well in opportunities that good education can provide. In College life, besides studies, is also an important goal for students. Therefore they need to effectively balance the two goals, which often conflict. In this pursuit, effective study habits can be very useful. They can help to learn effectively and efficiently, thus leaving sufficient time for other activities in life without compromising your academics. However, we have realized that many students are not clear on how to study effectively.", "121": "There is literature on this subject available— indeed there is a full book on it (multiple copies of which are in IIIT-D library). However, students often think these are too idealized or impractical, or that they do not apply to their environment or situation.", "122": "To better understand what works well in an environment like that of IIITDelhi, one of our graduating students (Digvijay Singh) interacted with a set of students from his batch who were known to have good understanding of various subjects, who we will refer to as effective students (this set of students we determined not by grades but by their performance in interviews and exams conducted by best companies that visited us and general input from faculty and students about their understanding, knowledge, skills). We further validated the outcome of this study by interacting with a set of students from the current batch who have been doing well. It should be noted that not all of them are in the high CGPA category— many of them are below 8.0. It should be pointed out that this is nota statistically and scientifically rigorous study. Also, the habits mentioned here are the common ones, which most effective students we talked to followed. It does not mean that these are the only methods. However, | believe if these practices are sound and if students follow these, they can expect to be effective in their learning.", "123": "The three main effective study practices that emerged are:", "124": "Attending lectures regularly and taking notes in them, even if the lectures are not very exciting/ engaging, is a practice most effective students followed. This makes sense, students who do not follow this in the hope that they will “make up” for the lectures they miss, generally do not end up “making up”, and soon find themselves lost with too much to catch up. And missing lectures can easily become a habit, which is clearly to be avoided.", "125": "The two aspects of this practice are:", "126": "Attend the lectures. Make notes in the lectures— not copy what the faculty is writing, but making notes in your own language. The second point is important— copying from the board/slide is a passive act which does not help in learning, but making notes in your own words is an active learning task, which engages the student and helps in learning. Paying attention in lectures actually helps save time—a student is likely to take much more time to understand and learn the topic by him/herself, if he/she does not attend the lecture, or is inattentive.", "127": "Do the assignments yourself—- most effective students did most of the assignments themselves, even if it took them more time or even if they were not able to complete in time. While lectures introduce the topics and concepts, the real learning and skill building of a student happens during assignments— this is where the students practices and tries to apply the concept/method. So, without doing assignments yourself, there can be really no learning. It should be noticed that taking help (not copying) from friends in assignments is fine, particularly when one is stuck. Indeed taking and giving help in the form of discussions, explanations, guiding is a good way of learning.", "128": "All effective students have some method of ensuring that they have revised the material covered in the previous week or so, and that they prepared for the next week’s lectures and work. This practice | am calling weekly sync-up (even though students might be practicing this over somewhat longer periods.) Some revise regularly, some do revision with the assignment, some during the weekends, etc., but one common theme is that they sync-up regularly and ensure that they are not behind or lost, as they realize that if they continue while being lost, they will not recover.(One student said that if he could not follow two lectures well, it was a big warning sign and he would put extra work to catch up). This practice ensures that even if they missed a lecture/assignment, they make up for it and do not fall behind. Without this practice, there is a real risk that a student can fall behind so much that it will be very hard to catch up. Ina semester of 4 months with a student doing 5 courses, one simply can’t really afford to fall behind too much! This can be viewed as the LAW for effective studying. Follow the LAW, with suitable enhancements/ modifications to suit your style, and the chances are that you will become an effective learner, and derive the benefits that come from that.", "129": "There are some other practices which some effective students also used:", "130": "When there are many tasks from multiple courses, as well as from other activities, there will clashing deadlines. Prioritising will clearly be important in such a situation to achieve the most in the limited time. As one student said: “In such a scenario, life becomes a lot easier when you manually set down targets to be achieved by what deadline (which may be before/same day as your submission deadlines). Use sticky notes as gentle reminders to yourself so you can use your time wisely when brunt of work is more.”  Group and Individual Projects  As said by one student: “While it is good to do projects in team to learn teamwork and leadership qualities, | used to push myself and sometimes go forth with individual projects. Undoubtedly, it takes more effort and time, but it boosted my confidence in my own abilities to handle projects single-handedly and made me more self-reliant and self-sufficient.”    Group Study Many prefer individual study  Take help from friends for understanding  Most students indicated that face-to-face discussion with friends was the first and most common approach they used for clarifying doubts/material. If this did not work then they will go to discuss it on forums, instructor.", "131": "Explain to them as explaining helps them understand better (my note: by discussing/clarifying you are helping your friend, but by providing your assignment to your friends for copying you are actually hurting them as you are discouraging them to learn, besides taking them the slippery slope of using unfair means)  Take help from friends for understanding  Most students indicated that face-to-face discussion with friends was the first and most common approach they used for clarifying doubts/material. If this did not work then they will go to discuss it on forums, instructor.", "132": "This is more a value statement but was commonly echoed by most of the students. While they all engaged in other activities (most of them are quite active in clubs, events, etc., they are clear that academics get the highest priority.)  Besides these practices, there is one attitude/trait | would like to highlight, which | have seen in many students who have done well in whatever they do after college education— and that is curiosity and initiative to go beyond the courses. Many effective students engage in some technical activities that they do which are not needed for their courses-— i.e. they take the initiative to go beyond the courses. Examples of these initiatives can be: participating in competitive programming, participating in technical clubs, learning on your own about topics that interest you, listening to some technical lectures on YouTube/Coursera/ EdX, trying out some concepts, learning some programming language on your own, teaching students who are facing challenges in their courses (teaching, it is well known and established, is the most effective way to learn— teaching to someone else truly clarifies the topic in one’s own mind) etc. | believe that those students who are ambitious and want to reach higher in life, developing this trait/ style is absolutely essential.", "133": "At lIIT-Delhi, the academic workload is on the heavier side. At the same time there are opportunities in the Institute and outside for pursuing non-academic interests, which are important to most students. Both these interests help in shaping up a good career. It is important to learn how to balance these two interests such that we students can pursue our non-academic interests without hurting our academics.               APPENDICES  | - Parking Policy  The vehicles entering the Campus shall do so from Gate No 1. Resident students are not allowed to park or use their personal vehicles inside the campus. The vehicles entering the Campus shall keep themselves to the left of the road. The campus is a No Horn Zone and a maximum speed of 20 km/hr is permissible. All day-scholars using their vehicles will have to display the car sticker prominently, while visitors’ vehicles shall do the necessary registration at the main gate at entry. The designated parking area for day-scholars is near the hostel. However due to construction this parking has been shifted to parking zone near academic block. Any vehicle reported by Faculty/Officers/SC/Security for violation will be fined Rs200/- first time, second violation will result in withdrawal of car sticker for one month and an entry into the personal record of the individual. The case will be referred to the disciplinary committee for any subsequent violations.", "134": "Students can collect the vehicle parking sticker from FMS. The sticker will be issued on production of the copy of the RC book as well as the driving license. Please note that no overnight parking is allowed inside the campus.", "135": "Students using IIIT-Delhi computing, networking and IT facilities are expected to abide by the following rules:", "136": "Students with authorized accounts may use the computing, networking, and other IT facilities for academic purposes, official Institute business, and for personal purposes so long as such use does not violate any law or any Institute policy.", "137": "Users are expected to take proper care of equipment and report any", "138": "malfunction to the staff on duty or to the in-charge of the facility. Users should not attempt to move, repair, reconfigure, modify, or attach external devices to the systems.", "139": "No food or drink is permitted in the laboratories. Also making noise either", "140": "through games/music/movies or talking and/ or singing loudly (the list is not exhaustive) is prohibited.", "141": "Violations of policy will be treated as academic misconduct, misdemeanour, or indiscipline as appropriate. Depending upon the nature of the violation, the institute authorities may take action by issuing a warning through disabling the account. In extreme cases, the account may be completely deleted and/or the user prohibited access to the IT facilities at IIIT-Delhi, and/or reported to the Disciplinary Action Committee. The policy may change as and when it is considered appropriate and new policies or changes in policy will take effect immediately after a brief announcement by any means, e-mail, printed notices, or through the newsgroups.", "142": "IV - Policy Where Student Leaves the Institute", "143": "If a student is graduating from the institute, his/her domain login will be deactivated soon after the convocation is over but their email id will be retained as part of the alumni database. If a student leaves the program without completing it, his/her email id will also be deactivated. All logins for Internet access (mobile, laptop, PDA etc) will be deactivated from the date of leaving the Institute, that is convocation day."}, "edges": {"0": {"topic": 0, "paras": 0}, "1": {"topic": 0, "paras": 1}, "2": {"topic": 0, "paras": 2}, "3": {"topic": 1, "paras": 3}, "4": {"topic": 2, "paras": 4}, "5": {"topic": 2, "paras": 5}, "6": {"topic": 2, "paras": 6}, "7": {"topic": 4, "paras": 7}, "8": {"topic": 5, "paras": 8}, "9": {"topic": 5, "paras": 9}, "10": {"topic": 6, "paras": 10}, "11": {"topic": 7, "paras": 11}, "12": {"topic": 8, "paras": 12}, "13": {"topic": 9, "paras": 13}, "14": {"topic": 9, "paras": 14}, "15": {"topic": 9, "paras": 15}, "16": {"topic": 9, "paras": 16}, "17": {"topic": 9, "paras": 17}, "18": {"topic": 10, "paras": 18}, "19": {"topic": 11, "paras": 19}, "20": {"topic": 11, "paras": 20}, "21": {"topic": 12, "paras": 21}, "22": {"topic": 13, "paras": 22}, "23": {"topic": 13, "paras": 23}, "24": {"topic": 13, "paras": 24}, "25": {"topic": 14, "paras": 25}, "26": {"topic": 15, "paras": 26}, "27": {"topic": 16, "paras": 27}, "28": {"topic": 17, "paras": 28}, "29": {"topic": 18, "paras": 29}, "30": {"topic": 18, "paras": 30}, "31": {"topic": 18, "paras": 31}, "32": {"topic": 18, "paras": 32}, "33": {"topic": 18, "paras": 33}, "34": {"topic": 18, "paras": 34}, "35": {"topic": 18, "paras": 35}, "36": {"topic": 19, "paras": 36}, "37": {"topic": 19, "paras": 37}, "38": {"topic": 20, "paras": 38}, "39": {"topic": 20, "paras": 39}, "40": {"topic": 20, "paras": 40}, "41": {"topic": 20, "paras": 41}, "42": {"topic": 20, "paras": 42}, "43": {"topic": 21, "paras": 43}, "44": {"topic": 22, "paras": 44}, "45": {"topic": 22, "paras": 45}, "46": {"topic": 23, "paras": 46}, "47": {"topic": 24, "paras": 47}, "48": {"topic": 24, "paras": 48}, "49": {"topic": 25, "paras": 49}, "50": {"topic": 25, "paras": 50}, "51": {"topic": 25, "paras": 51}, "52": {"topic": 26, "paras": 52}, "53": {"topic": 27, "paras": 53}, "54": {"topic": 28, "paras": 54}, "55": {"topic": 30, "paras": 55}, "56": {"topic": 30, "paras": 56}, "57": {"topic": 30, "paras": 57}, "58": {"topic": 31, "paras": 58}, "59": {"topic": 32, "paras": 59}, "60": {"topic": 32, "paras": 60}, "61": {"topic": 32, "paras": 61}, "62": {"topic": 33, "paras": 62}, "63": {"topic": 34, "paras": 63}, "64": {"topic": 34, "paras": 64}, "65": {"topic": 34, "paras": 65}, "66": {"topic": 34, "paras": 66}, "67": {"topic": 34, "paras": 67}, "68": {"topic": 34, "paras": 68}, "69": {"topic": 36, "paras": 69}, "70": {"topic": 37, "paras": 70}, "71": {"topic": 38, "paras": 71}, "72": {"topic": 39, "paras": 72}, "73": {"topic": 39, "paras": 73}, "74": {"topic": 40, "paras": 74}, "75": {"topic": 41, "paras": 75}, "76": {"topic": 42, "paras": 76}, "77": {"topic": 42, "paras": 77}, "78": {"topic": 43, "paras": 78}, "79": {"topic": 44, "paras": 79}, "80": {"topic": 45, "paras": 80}, "81": {"topic": 46, "paras": 81}, "82": {"topic": 47, "paras": 82}, "83": {"topic": 48, "paras": 83}, "84": {"topic": 49, "paras": 84}, "85": {"topic": 49, "paras": 85}, "86": {"topic": 49, "paras": 86}, "87": {"topic": 50, "paras": 87}, "88": {"topic": 50, "paras": 88}, "89": {"topic": 50, "paras": 89}, "90": {"topic": 50, "paras": 90}, "91": {"topic": 50, "paras": 91}, "92": {"topic": 51, "paras": 92}, "93": {"topic": 51, "paras": 93}, "94": {"topic": 51, "paras": 94}, "95": {"topic": 52, "paras": 95}, "96": {"topic": 52, "paras": 96}, "97": {"topic": 53, "paras": 97}, "98": {"topic": 54, "paras": 98}, "99": {"topic": 54, "paras": 99}, "100": {"topic": 54, "paras": 100}, "101": {"topic": 54, "paras": 101}, "102": {"topic": 55, "paras": 102}, "103": {"topic": 55, "paras": 103}, "104": {"topic": 55, "paras": 104}, "105": {"topic": 55, "paras": 105}, "106": {"topic": 55, "paras": 106}, "107": {"topic": 55, "paras": 107}, "108": {"topic": 57, "paras": 108}, "109": {"topic": 57, "paras": 109}, "110": {"topic": 57, "paras": 110}, "111": {"topic": 57, "paras": 111}, "112": {"topic": 57, "paras": 112}, "113": {"topic": 57, "paras": 113}, "114": {"topic": 57, "paras": 114}, "115": {"topic": 57, "paras": 115}, "116": {"topic": 57, "paras": 116}, "117": {"topic": 59, "paras": 117}, "118": {"topic": 59, "paras": 118}, "119": {"topic": 60, "paras": 119}, "120": {"topic": 61, "paras": 120}, "121": {"topic": 61, "paras": 121}, "122": {"topic": 61, "paras": 122}, "123": {"topic": 61, "paras": 123}, "124": {"topic": 62, "paras": 124}, "125": {"topic": 62, "paras": 125}, "126": {"topic": 62, "paras": 126}, "127": {"topic": 63, "paras": 127}, "128": {"topic": 64, "paras": 128}, "129": {"topic": 64, "paras": 129}, "130": {"topic": 65, "paras": 130}, "131": {"topic": 66, "paras": 131}, "132": {"topic": 67, "paras": 132}, "133": {"topic": 68, "paras": 133}, "134": {"topic": 68, "paras": 134}, "135": {"topic": 69, "paras": 135}, "136": {"topic": 70, "paras": 136}, "137": {"topic": 70, "paras": 137}, "138": {"topic": 70, "paras": 138}, "139": {"topic": 70, "paras": 139}, "140": {"topic": 70, "paras": 140}, "141": {"topic": 70, "paras": 141}, "142": {"topic": 70, "paras": 142}, "143": {"topic": 70, "paras": 143}}}